app/Controllers/AdminController.php

    public function dashboard()
    {
        // Debug: tampilkan data untuk troubleshooting
        $wisataData = $this->wisataModel->getAllWithRelations();
        $kategoriData = $this->kategoriModel->findAll();
        $kotaData = $this->kotaModel->findAll();
        $kecamatanData = $this->kecamatanModel->getWithKota();
        $usersData = $this->userModel->findAll(); // NEW: Ambil data users
---
SELECT *
FROM `kategori`
SELECT *
FROM `kota`
SELECT *
FROM `user`

    public function createKecamatan()
    {
        $nama = $this->request->getPost('nama_kecamatan');
        $kotaId = $this->request->getPost('kota_id');

        if (empty($nama) || empty($kotaId)) {
            return redirect()->back()->with('error', 'Nama kecamatan dan kota harus diisi');
        }

        $data = [
            'nama_kecamatan' => $nama,
            'kota_id' => $kotaId,
            'created_at' => date('Y-m-d H:i:s')
        ];

        $this->kecamatanModel->insert($data);
---
INSERT INTO `kecamatan` (`nama_kecamatan`, `kota_id`) VALUES ('test', '1')