app/Controllers/AuthController.php

    public function profil()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = (int) session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Session tidak valid');
        }

        $user = $this->userModel->find($userId);
        if (!$user) {
            return redirect()->to('/login')->with('error', 'User tidak ditemukan');
        }

        // Preload kota/kecamatan ke memori (cache 24 jam)
        $kotaKecamatan = $this->buildKotaKecamatanCombined();

        // Hitung bookmark langsung dari DB (tanpa fetch di client)
        // GANTI 'wishlist' bila nama tabelmu berbeda.
        $db            = \Config\Database::connect();
        $bookmarkCount = (int) $db->table('wishlist')->where('user_id', $userId)->countAllResults();
---
SELECT *
FROM `user`
WHERE `user`.`id` = 1
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = 1

    public function updateProfil()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = (int) session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Session tidak valid');
        }

        $currentUser = $this->userModel->find($userId);
        $currentAkun = $this->akunModel->where('user_id', $userId)->first();
---
SELECT *
FROM `user`
WHERE `user`.`id` = '2'
SELECT *
FROM `akun`
WHERE `user_id` = 2
 LIMIT 1