app/Controllers/AuthController.php

SELECT COUNT(*) AS `numrows`
FROM `bookmark`
WHERE `user_id` = 1
---
    public function profil()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = (int) session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Session tidak valid');
        }

        $user = $this->userModel->find($userId);
        if (!$user) {
            return redirect()->to('/login')->with('error', 'User tidak ditemukan');
        }

        // Preload kota/kecamatan ke memori (cache 24 jam)
        $kotaKecamatan = $this->buildKotaKecamatanCombined();

        // Hitung bookmark langsung dari DB (tanpa fetch di client)
        // GANTI 'wishlist' bila nama tabelmu berbeda.
        $db            = \Config\Database::connect();
        $bookmarkCount = (int) $db->table('bookmark')->where('user_id', $userId)->countAllResults();