app/Controllers/DashboardController.php

    public function index()
    {
        // TAMBAHAN: Ambil semua data kategori dari database
        $kategoriData = $this->kategoriModel->findAll();

        // Ambil data wisata populer (6 wisata terbaru) dengan gambar utama
        $wisataPopuler = $this->wisataModel
            ->select('wisata.*, kategori.nama_kategori, kota.nama_kota, kecamatan.nama_kecamatan, galeri.nama_file as primary_image')
            ->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
            ->join('kota', 'kota.kota_id = wisata.kota_id')
            ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
            ->join('galeri', 'galeri.wisata_id = wisata.wisata_id AND galeri.is_primary = 1', 'left')
            ->orderBy('wisata.wisata_id', 'DESC')
            ->limit(6)
            ->findAll();

        // Ambil data untuk slider (4 wisata random)
        $sliderWisata = $this->wisataModel
            ->select('wisata.*, galeri.nama_file as primary_image')
            ->join('galeri', 'galeri.wisata_id = wisata.wisata_id AND galeri.is_primary = 1', 'left')
            ->orderBy('RAND()')
            ->limit(4)
            ->findAll();
---
SELECT *
FROM `kategori`
SELECT `wisata`.*, `kategori`.`nama_kategori`, `kota`.`nama_kota`, `kecamatan`.`nama_kecamatan`, `galeri`.`nama_file` as `primary_image`
FROM `wisata`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
LEFT JOIN `galeri` ON `galeri`.`wisata_id` = `wisata`.`wisata_id` AND `galeri`.`is_primary` = 1
ORDER BY `wisata`.`wisata_id` DESC
 LIMIT 6
SELECT `wisata`.*, `galeri`.`nama_file` as `primary_image`
FROM `wisata`
LEFT JOIN `galeri` ON `galeri`.`wisata_id` = `wisata`.`wisata_id` AND `galeri`.`is_primary` = 1
ORDER BY RAND()
 LIMIT 4