app/Controllers/UserController.php

    private function getKategoriData()
{
    return $this->kategoriModel->findAll();
---
SELECT *
FROM `kategori`

public function kategoriWisata($namaKategori = null)
{
    if (!$namaKategori) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException('Kategori tidak ditemukan');
    }

    // Ubah URL-friendly name kembali ke nama asli
    $namaKategori = ucfirst(strtolower($namaKategori));

    // Cek apakah kategori exists
    $kategoriData = $this->kategoriModel->where('nama_kategori', $namaKategori)->first();
---
SELECT *
FROM `kategori`
WHERE `nama_kategori` = 'Tari'
 LIMIT 1