app/Models/BookmarkModel.php

    public function getUserBookmarks($userId)
    {
        return $this->select('bookmark.*, wisata.*, kategori.nama_kategori, kecamatan.nama_kecamatan, kota.nama_kota')
                   ->join('wisata', 'wisata.wisata_id = bookmark.wisata_id')
                   ->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
                   ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
                   ->join('kota', 'kota.kota_id = wisata.kota_id')
                   ->where('bookmark.user_id', $userId)
                   ->orderBy('bookmark.created_at', 'DESC')
                   ->findAll();
---
SELECT `bookmark`.*, `wisata`.*, `kategori`.`nama_kategori`, `kecamatan`.`nama_kecamatan`, `kota`.`nama_kota`
FROM `bookmark`
JOIN `wisata` ON `wisata`.`wisata_id` = `bookmark`.`wisata_id`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`
WHERE `bookmark`.`user_id` = '1'
ORDER BY `bookmark`.`created_at` DESC