app/Models/GaleriModel.php

SELECT *
FROM `galeri`
WHERE `wisata_id` = '6'
ORDER BY `is_primary` DESC, `galeri_id` ASC
---
    public function getByWisata($wisataId)
    {
        return $this->where('wisata_id', $wisataId)
                    ->orderBy('is_primary', 'DESC')
                    ->orderBy('galeri_id', 'ASC')
                    ->findAll();

SELECT *
FROM `galeri`
WHERE `wisata_id` = '6'
AND `is_primary` = 1
 LIMIT 1
---
    public function getPrimaryImage($wisataId)
    {
        return $this->where('wisata_id', $wisataId)
                    ->where('is_primary', 1)
                    ->first();