app/Models/KecamatanModel.php

SELECT `kecamatan`.*, `kota`.`nama_kota`
FROM `kecamatan`
JOIN `kota` ON `kota`.`kota_id` = `kecamatan`.`kota_id`
ORDER BY `kota`.`nama_kota` ASC, `kecamatan`.`nama_kecamatan` ASC
---
    public function getWithKota()
    {
        return $this->select('kecamatan.*, kota.nama_kota')
                    ->join('kota', 'kota.kota_id = kecamatan.kota_id')
                    ->orderBy('kota.nama_kota', 'ASC')
                    ->orderBy('kecamatan.nama_kecamatan', 'ASC')
                    ->findAll();