app/Models/WisataModel.php

    public function getAllWithRelations()
    {
        return $this->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
                    ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
                    ->join('kota', 'kota.kota_id = wisata.kota_id')
                    ->select('wisata.*, kategori.nama_kategori, kecamatan.nama_kecamatan, kota.nama_kota')
                    ->findAll();
---
SELECT `wisata`.*, `kategori`.`nama_kategori`, `kecamatan`.`nama_kecamatan`, `kota`.`nama_kota`
FROM `wisata`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`

    public function getByKategori($kategori)
    {
        return $this->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
                    ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
                    ->join('kota', 'kota.kota_id = wisata.kota_id')
                    ->where('kategori.nama_kategori', $kategori)
                    ->select('wisata.*, kategori.nama_kategori, kecamatan.nama_kecamatan, kota.nama_kota')
                    ->findAll();
---
SELECT `wisata`.*, `kategori`.`nama_kategori`, `kecamatan`.`nama_kecamatan`, `kota`.`nama_kota`
FROM `wisata`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`
WHERE `kategori`.`nama_kategori` = 'Tari'

    public function getWithRelations($id)
    {
        return $this->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
                    ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
                    ->join('kota', 'kota.kota_id = wisata.kota_id')
                    ->where('wisata.wisata_id', $id)
                    ->select('wisata.*, kategori.nama_kategori, kecamatan.nama_kecamatan, kota.nama_kota')
                    ->first();
---
SELECT `wisata`.*, `kategori`.`nama_kategori`, `kecamatan`.`nama_kecamatan`, `kota`.`nama_kota`
FROM `wisata`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`
WHERE `wisata`.`wisata_id` = '6'
 LIMIT 1