app/Models/WishlistModel.php

    public function isBookmarked($userId, $wisataId)
    {
        return $this->where('user_id', $userId)
                   ->where('wisata_id', $wisataId)
                   ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '1'
AND `wisata_id` = '6'

    public function getUserBookmarks($userId)
    {
        return $this->select('wishlist.*, wisata.*, kategori.nama_kategori, kecamatan.nama_kecamatan, kota.nama_kota')
                   ->join('wisata', 'wisata.wisata_id = wishlist.wisata_id')
                   ->join('kategori', 'kategori.kategori_id = wisata.kategori_id')
                   ->join('kecamatan', 'kecamatan.kecamatan_id = wisata.kecamatan_id')
                   ->join('kota', 'kota.kota_id = wisata.kota_id')
                   ->where('wishlist.user_id', $userId)
                   ->orderBy('wishlist.created_at', 'DESC')
                   ->findAll();
---
SELECT `wishlist`.*, `wisata`.*, `kategori`.`nama_kategori`, `kecamatan`.`nama_kecamatan`, `kota`.`nama_kota`
FROM `wishlist`
JOIN `wisata` ON `wisata`.`wisata_id` = `wishlist`.`wisata_id`
JOIN `kategori` ON `kategori`.`kategori_id` = `wisata`.`kategori_id`
JOIN `kecamatan` ON `kecamatan`.`kecamatan_id` = `wisata`.`kecamatan_id`
JOIN `kota` ON `kota`.`kota_id` = `wisata`.`kota_id`
WHERE `wishlist`.`user_id` = '1'
ORDER BY `wishlist`.`created_at` DESC